import { Injectable } from '@nestjs/common';
import { Context, Markup } from 'telegraf';
import { EComands } from '@app/enums';
@Injectable()
export class TelegramStartService {
  async start(ctx: Context): Promise<void> {
    const commonMenu = [
      [Markup.button.callback('🤔 Вказати команду', EComands.ADD_TEAM)],
      [Markup.button.callback('🫶🏼 Улюблені', EComands.SEE_FAVORITES)],
    ];

    await ctx.replyWithHTML(
      `<b>Вітаємо тебе у світі футбольних емоцій, новий друже! 👋</b>
            \n⚽ Ти крокнув у захоплюючий світ нашого телеграм боту, де кожен матч, кожен гол і кожен переможний момент стають частиною твоєї футбольної пригоди.
            \n<b>Доступний функціонал бота:</b>
            \n1. <b>Додавання улюблених команд:</b> Користувач може додавати свої улюблені футбольні команди до списку обраного. Це дає можливість отримувати оновлення про них та доступ до інших функцій, пов'язаних з цими командами.
            \n2. <b>Статистика по улюбленим командам:</b> Користувач може переглядати статистичні дані про свої улюблені команди, такі як результати, голи, жовті та червоні картки тощо.
            \n3. <b>Прогнози на майбутні матчі:</b> Бот надає прогнози на майбутні матчі улюблених команд, допомагаючи користувачам зробити приблизну оцінку результатів.
            \n4. <b>Мінулі ігри:</b> Користувач може переглядати історію минулих матчів своїх улюблених команд, разом із результатами та основними подіями матчу.
            \n5. <b>Нагадування про майбутні матчі:</b> Бот надсилає користувачеві нагадування про майбутні матчі його улюблених команд за певний період часу перед початком матчу.
            \n6. <b>Текстова трансляція матчів:</b> Користувач може переглядати текстову трансляцію матчів своїх улюблених команд, отримуючи оновлення про події на полі в режимі реального часу.
            \n\nЯкщо в тебе вже є додані команди, то ти можеш вибрати "🫶🏼 Улюблені" або вказати нові скориставшись пунктом меню 👇`,
      Markup.keyboard(commonMenu),
    );
  }
}
